package example;

import java.util.Scanner;

public class Omok_ex {
	//검은돌이 먼저 시작한다
	// x,y좌표를 입력하면 해당 턴의 돌이 지정된 좌표의 내용물을 대체하며 자신의 돌이 놔진다
	// 검은색 -> 흰색 -> 검은색 -> 흰색 순으로 선택권이 넘어간다
	// 이미 돌이 놓아진곳에는 다시 돌을 놓을수 없다
	
	// 승리는 어떻게 인식?
	
	
	public static void main(String[] args) {
		


		
		char[][] omok = {
				{'┌','┬','┬','┬','┬','┬','┬','┬','┬','┐'},
				{'├','┼','┼','┼','┼','┼','┼','┼','┼','┤'},
				{'├','┼','┼','┼','┼','┼','┼','┼','┼','┤'},
				{'├','┼','┼','┼','┼','┼','┼','┼','┼','┤'},
				{'├','┼','┼','┼','┼','┼','┼','┼','┼','┤'},
				{'├','┼','┼','┼','┼','┼','┼','┼','┼','┤'},
				{'├','┼','┼','┼','┼','┼','┼','┼','┼','┤'},
				{'├','┼','┼','┼','┼','┼','┼','┼','┼','┤'},
				{'└','┴','┴','┴','┴','┴','┴','┴','┴','┘'},
		};
	
		for (int i = 0; i < omok.length; ++i) {
			for (int j = 0; j < omok[i].length; ++j) {
				System.out.printf("%-2c", omok[i][j]);
			}
			System.out.println();
		}
		
		System.out.println("흑돌이 놓을 차례입니다");
		
		
		
	}
}	